apache/nuttx/arch/arm/src/stm32h7/stm32_mdio.c
/****************************************************************************
 * arch/arm/src/stm32h7/stm32_mdio.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/mutex.h>
#include <nuttx/config.h>
#include <nuttx/nuttx.h>

#include <nuttx/debug.h>
#include <errno.h>
#include <inttypes.h>

#include "arm_internal.h"
#include "stm32_mdio.h"
#include "hardware/stm32_ethernet.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifdef CONFIG_STM32_ETHMAC_REGDEBUG
static uint32_t stm32_getreg(uint32_t addr);
static void stm32_putreg(uint32_t val, uint32_t addr);
static void stm32_checksetup(void);
#else
#  define stm32_getreg(addr)     getreg32(addr)
#  define stm32_putreg(val,addr) putreg32(val,addr)
#  define stm32_checksetup()
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32_mdio_lowerhalf_s
{
  struct mdio_lowerhalf_s base;

  /* MDIO bus timeout in microseconds */

  int timeout;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int stm32_c22_read(struct mdio_lowerhalf_s *dev, uint8_t phydev,
                    uint8_t regaddr, uint16_t *value);

static int stm32_c22_write(struct mdio_lowerhalf_s *dev, uint8_t phydev,
                     uint8_t regaddr, uint16_t value);

/****************************************************************************
 * Private Data
 ****************************************************************************/

const struct mdio_ops_s g_stm32_mdio_ops =
{
  .read  = stm32_c22_read,
  .write = stm32_c22_write,
  .reset = NULL,
};

struct stm32_mdio_lowerhalf_s g_stm32_mdio_lowerhalf =
{
  .base =
    {
      .ops = &g_stm32_mdio_ops
    },
  .timeout = 10000
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static int stm32_c22_read(struct mdio_lowerhalf_s *dev, uint8_t phydev,
                          uint8_t regaddr, uint16_t *value)
{
  int to;
  uint32_t regval;

  int retval = -ETIMEDOUT;
  struct stm32_mdio_lowerhalf_s *priv =
         container_of(dev, struct stm32_mdio_lowerhalf_s, base);

  /* Configure the MACMDIOAR register, preserving CSR Clock Range CR[3:0]
   * bits
   */

  regval  = stm32_getreg(STM32_ETH_MACMDIOAR);
  regval &= ETH_MACMDIOAR_CR_MASK;

  /* Set the PHY device address, PHY register address, and set the buy bit.
   * the ETH_MACMDIOAR_GOC == 3, indicating a read operation.
   */

  regval |= (((uint32_t)phydev << ETH_MACMDIOAR_PA_SHIFT) &
            ETH_MACMDIOAR_PA_MASK);
  regval |= (((uint32_t)regaddr << ETH_MACMDIOAR_RDA_SHIFT) &
            ETH_MACMDIOAR_RDA_MASK);
  regval |= ETH_MACMDIOAR_MB | ETH_MACMDIOAR_GOC_READ;

  stm32_putreg(regval, STM32_ETH_MACMDIOAR);

  /* Wait for the transfer to complete.  A Clause 22 frame is 64 MDC
   * cycles, about 30 us at a 2.5 MHz MDC, so poll at a fraction of that.
   * A millisecond delay here turns every PHY register access into a
   * busy-wait far longer than the transfer, and the autonegotiation link
   * wait in stm32_phyinit() issues thousands of them.
   */

  for (to = priv->timeout; to > 0; to -= 10)
    {
      if ((stm32_getreg(STM32_ETH_MACMDIOAR) & ETH_MACMDIOAR_MB) == 0)
        {
          *value = (uint16_t)stm32_getreg(STM32_ETH_MACMDIODR);
          retval = OK;
          break;
        }

      up_udelay(10);
    }

  if (retval < 0)
    {
      ninfo("MII transfer timed out: phydev: %04x regaddr: %04x\n",
            phydev, regaddr);
    }

  return retval;
}

static int stm32_c22_write(struct mdio_lowerhalf_s *dev, uint8_t phydev,
                           uint8_t regaddr, uint16_t value)
{
  int to;
  uint32_t regval;

  int retval = -ETIMEDOUT;
  struct stm32_mdio_lowerhalf_s *priv =
         container_of(dev, struct stm32_mdio_lowerhalf_s, base);

  /* Configure the MACMDIOAR register, preserving CSR Clock Range CR[3:0]
   * bits
   */

  regval  = stm32_getreg(STM32_ETH_MACMDIOAR);
  regval &= ETH_MACMDIOAR_CR_MASK;

  /* Read the existing register value, if clear mask is given */

  /* Set the PHY device address, PHY register address, and set the busy bit.
   * the ETH_MACMDIOAR_GOC == 1, indicating a write operation.
   */

  regval |= (((uint32_t)phydev << ETH_MACMDIOAR_PA_SHIFT) &
            ETH_MACMDIOAR_PA_MASK);
  regval |= (((uint32_t)regaddr << ETH_MACMDIOAR_RDA_SHIFT) &
            ETH_MACMDIOAR_RDA_MASK);
  regval |= (ETH_MACMDIOAR_MB | ETH_MACMDIOAR_GOC_WRITE);

  /* Write the value into the MACMDIODR register before setting the new
   * MACMDIOAR register value.
   */

  stm32_putreg(value, STM32_ETH_MACMDIODR);
  stm32_putreg(regval, STM32_ETH_MACMDIOAR);

  /* Wait for the transfer to complete */

  for (to = priv->timeout; to > 0; to -= 10)
    {
      if ((stm32_getreg(STM32_ETH_MACMDIOAR) & ETH_MACMDIOAR_MB) == 0)
        {
          retval = OK;
          break;
        }

      up_udelay(10);
    }

  if (retval < 0)
    {
      ninfo("MII transfer timed out: phydevaddr: %04x phyregaddr: %04x"
            "value: %04x\n", phydev, regaddr, value);
    }

  return retval;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_mdio_bus_initialize
 *
 * Description:
 *   Initialize the MDIO bus
 *
 * Returned Value:
 *   Initialized MDIO bus structure or NULL on failure
 *
 ****************************************************************************/

struct mdio_bus_s *stm32_mdio_bus_initialize(void)
{
  return mdio_register(&g_stm32_mdio_lowerhalf.base);
}
